{
  "results": [
    {
      "title": "Kerala Blasters issue statement following Police action on Fan Protests in Kochi ",
      "link": "https://www.news18.com/football/isl-transfer-news-kerala-blasters-rope-in-montenegro-midfielder-dusan-lagator-9190004.html",
      "description": "Kerala Blasters have broken their silence following an ugly incident involving fan and police in Kochi.\nThe club has been hurled with external issues as fans have grown impatient and shown their grievance to the management.\n There were protests with banners from the fans in their match against Punjab FC. At the Jawaharlal Nehru Stadium in New Delhi, members of the Manjappada fan group made their discontent known both inside and outside the venue following Kerala Blasters' match. A social media post from the group read, \"We stand, we fight, we demand better,\" highlighting their dissatisfaction. Fans displayed banners with strong messages such as \"Stop selling, stay buying,\" \"Scam continues,\" and \"No more mediocrity,\" all aimed at expressing their frustration with the management, particularly the Hyderabad-based owners.\nFollowing that, the Manjappada fans were staging a protest outside the Jawaharlal Nehru Stadium in Kaloor, Kochi - where they were vandalized by the police.\n\n \nAs an aftermath, Kerala Blasters have released an official statement addressing recent events involving fan protests outside the stadium, where chanting by fans was reportedly interrupted by police intervention. The club expressed its strong stance on the matter, emphasizing its commitment to the rights of fans while distancing itself from any involvement in the actions of the State Police force.\n\n \n\"Kerala Blasters FC would like to comment on the recent events involving fan protests outside the stadium and chanting being interrupted by the police,\" a media release from Kerala Blasters read on Thursday (January 16).\n\n\"At the outset, the Club would like to strongly reinforce the fact that it has no power to instruct the State's Police force on their understanding and acting in certain situations to maintain law and order. The club also places on record that the police intervention was not instructed by the club, as we are not a part of the law and order mechanism which is handled by much more competent and independent authorities,\" it added.\n\nKerala Blasters FC reaffirmed that it has never attempted to suppress fan expressions in designated safe zones that do not compromise public safety or disrupt the matchday experience. The club also criticized the misleading narrative circulating in the public domain, where the club has been blamed for acting against the fans.\n\n \n\"The narrative being widely spread in the public domain regarding the Club instructing the police forces to carry out certain actions is wrong, misleading, and baseless,\" the statement further added.",
      "pubDate": "2025-01-16 12:32:30",
      "image_url": "https://images.mykhel.com/webp/img/2025/01/kbfc-fan-protest-statement1-1737009158.jpg",
      "source_name": "myKhel"
    },{
      "title": "ISL Transfer News: Kerala Blasters Rope In Montenegro Midfielder Dusan Lagator",
      "link": "https://www.news18.com/football/isl-transfer-news-kerala-blasters-rope-in-montenegro-midfielder-dusan-lagator-9190004.html",
      "description": "Kerala Blasters FC has announced the signing of Montenegrin defensive midfielder Dušan Lagator. The player has signed a contract with the club, till May 2026. The 30-year-old midfielder brings a wealth of experience, having played nearly 300 matches for various clubs across Europe. Lagator has also represented the Montenegro National Team at the Under-19, Under-21, and senior levels.\nLagator began his professional career in 2011 with the Montenegrin club FK Mogren and has scored 10 goals over the course of his career. He is expected to join the squad shortly and commence training.\nKnown for his defensive solidity, aerial ability, and tactical awareness, Lagator’s versatility allows him to operate effectively as a defensive midfielder, providing flexibility to the team’s defensive structure.",
      "pubDate": "2025-01-15 14:09:30",
      "image_url": "https://images.news18.com/ibnlive/uploads/2025/01/copy-of-sports-43-2025-01-cdd40f6f9c890a4e91818d28da52bc8b-3x2.jpg",
      "source_name": "News 18"
    },
    {
      "title": "ISL 2024-25: Kerala Blasters announces signing of Montenegrin midfielder Dusan Lagator",
      "link": "https://sportstar.thehindu.com/football/indian-super-league-transfer-news-kerala-blasters-announces-midfielder-dusan-lagator/article69101332.ece",
      "description": "Indian Super League club Kerala Blasters FC announced the signing of Montenegrin defensive midfielder Dušan Lagator on Wednesday.\n\nThe 30-year-old, whose contract runs till May 2026, has played nearly 300 matches for various clubs across Europe. Lagator has also represented the Montenegro National Team at the Under-19, Under-21, and senior levels.\n\nLagator began his professional career in 2011 with the Montenegrin club FK Mogren and has scored 10 goals over the course of his career. He is expected to join the squad shortly and commence training.\nKnown for his defensive solidity, aerial ability, and tactical awareness, Lagator’s versatility allows him to operate effectively as a defensive midfielder, providing flexibility to the team’s defensive structure.\n\n“Dusan is a player with considerable experience, and his ability to control the midfield will add great value to our team. We are excited to see him in action and wish him the best,” commented Karolis Skynkis, the Sporting Director of Kerala Blasters FC.\n\n“I’m excited to join a club like Kerala Blasters FC because of the vision and project that was shared with me. I look forward to contributing to the team’s success and experiencing the unique football culture here in Kerala,” said Lagator.\n",
      "pubDate": "2025-01-15 14:08:12",
      "image_url": "https://ss-i.thgim.com/public/incoming/ddvmyv/article69101315.ece/alternates/LANDSCAPE_1200/Du%C5%A1an%20Lagator%20-%202.jpg",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "Mohammedan SC vs Chennaiyin FC, ISL 2024-25 Live Streaming Online on JioCinema: Watch Telecast of MSC vs CFC Match in Indian Super League 11 on TV and Online",
      "link": "https://www.latestly.com/sports/football/mohammedan-sc-vs-chennaiyin-fc-isl-2024-25-live-streaming-online-on-jiocinema-watch-telecast-of-msc-vs-cfc-match-in-indian-super-league-11-on-tv-and-online-6567132.html",
      "description": "Mohammedan SC and Chennaiyin FC will face each other on matchday 16 of the ISL 2024-25 season. Check out the live streaming and viewing options for the Mohammedan SC vs Chennaiyin FC ISL 2024-25 match.",
      "pubDate": "2025-01-15 09:17:01",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2024/10/Chennaiyin-FC-players-in-a-huddle-380x214.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "ISL 2024-25: Mohammedan Sporting rides on stoppage-time double to hold Chennaiyin FC to 2-2 draw",
      "link": "https://sportstar.thehindu.com/football/indian-football/isl-2024-25-mohammedan-sporting-draws-2-2-with-chennaiyin-fc-msc-v-cfc-indian-super-league/article69102216.ece",
      "description": "Chennaiyin FC looked to secure three points from the game till the last minute of regulation time when a six-minute double in injury time saw Mohammedan Sporting draw the contest.\n \nMohammedan Sporting pulled up a dramatic draw with two goals in the injury time to hold Chennaiyin FC 2-2 in an Indian Super League (ISL) 11 encounter at the Kishore Bharati Stadium here on Wednesday.\n\nChennaiyin enjoyed a healthy two-goal lead till the end of the regulation time with strikes from Pachuau Laldinpuia and Lukas Brambilla once in each half.\n\nMohammedan Sporting made a spectacular turnaround in the nine minutes added as injury-time when substitute Manvir Singh Saini reduced the margin in the fifth minute (90+5). Lalremsanga Fanai brought up the equaliser, converting a penalty awarded in the last minute of the injury time. Manvir Singh was tripped inside the box by Laldinpuia, who was given marching orders after the incident.\n\nChennaiyin FC remained in the 10th spot in the current standings, with 17 points from 16 matches while Mohammedan Sporting, too, did not see any improvement in its status after the draw, sitting 12th, with 11 points from 16 games.\nThe Marina Machans took control of the game early and converted its dominance with a goal in the 10th minute when Pachuau Laldinpuia nodded home from close after Connor Shields set his corner right on top of the six-yard box.\n\nMohammedan Sporting had a chance to equalise in the 27th minute when it earned the first penalty but Mirjalol Kasimov’s attempt from the spot was saved by the Mohammad Nawaz. Chennaiyin doubled the lead early in the second half through Brazilian midfielder Brambilla’s goal but failed to secure the win in the end.\n \nMohammedan Sporting pulled up a dramatic draw with two goals in the injury time to hold Chennaiyin FC 2-2 in an Indian Super League (ISL) 11 encounter at the Kishore Bharati Stadium here on Wednesday.\n\nChennaiyin enjoyed a healthy two-goal lead till the end of the regulation time with strikes from Pachuau Laldinpuia and Lukas Brambilla once in each half.\n\nMohammedan Sporting made a spectacular turnaround in the nine minutes added as injury-time when substitute Manvir Singh Saini reduced the margin in the fifth minute (90+5). Lalremsanga Fanai brought up the equaliser, converting a penalty awarded in the last minute of the injury time. Manvir Singh was tripped inside the box by Laldinpuia, who was given marching orders after the incident.\n\nChennaiyin FC remained in the 10th spot in the current standings, with 17 points from 16 matches while Mohammedan Sporting, too, did not see any improvement in its status after the draw, sitting 12th, with 11 points from 16 games.\n\nLalremsanga Fanai of Mohammedan Sporting Club scores the equalising goal against Chennaiyin FC at the Kishore Bharati Krirangan in Kolkata. | Photo Credit: FSDL/ISL Media\nThe Marina Machans took control of the game early and converted its dominance with a goal in the 10th minute when Pachuau Laldinpuia nodded home from close after Connor Shields set his corner right on top of the six-yard box.\n\nMohammedan Sporting had a chance to equalise in the 27th minute when it earned the first penalty but Mirjalol Kasimov’s attempt from the spot was saved by the Mohammad Nawaz. Chennaiyin doubled the lead early in the second half through Brazilian midfielder Brambilla’s goal but failed to secure the win in the end.\n\n\nAfter missing a few good scoring opportunities in regulation time, Mohammedan Sporting found the target when the fans in the stands appeared to be certain about the side suffering another defeat at home.\n\nManvir Singh got an angular attempt home to brighten the hopes and then set up the second. Lalremsanga made no mistake from the spot to restore parity for a side which had created one of the biggest upsets of the tournament by beating Bengaluru FC (1-0) at the latter’s home four days ago.",
      "pubDate": "2025-01-15 17:54:02",
      "image_url": "https://ss-i.thgim.com/public/incoming/dzm0jr/article69102222.ece/alternates/LANDSCAPE_1200/AVI_9777.jpg",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "Sports News | Punjab FC Fight to End 2-match Home Losing Streak as Mumbai City FC Eye Season Turnaround",
      "link": "https://www.latestly.com/agency-news/sports-news-punjab-fc-fight-to-end-2-match-home-losing-streak-as-mumbai-city-fc-eye-season-turnaround-6568213.html",
      "description": "Get latest articles and stories on Sports at LatestLY. Punjab FC (PFC) will host Mumbai City FC (MCFC) at the Jawaharlal Nehru Stadium in New Delhi in the Indian Super League (ISL) on Thursday. Punjab FC will look to complete their first league double over the Islanders (MCFC), while Mumbai City FC will aim to extend their unbeaten away streak and reclaim defensive strength after recent setbacks.",
      "pubDate": "2025-01-15 14:20:22",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2025/01/ANI-20250115140221-380x214.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "ISL: NorthEast United grab a point in gripping end-to-end draw with FC Goa",
      "link": "https://www.mid-day.com/sports/football/article/isl-northeast-united-grab-a-point-in-gripping-end-to-end-draw-with-fc-goa-23464974",
      "description": "After getting frustrated with a sustained spell of long balls, the Highlanders decided to hit FC Goa on the counter",
      "pubDate": "2025-01-15 08:07:13",
      "image_url": "https://images.mid-day.com/images/images/2025/jan/football-stock-d_d.jpg",
      "source_name": "Mid-day"
    },
    {
      "title": "Sports News | ISL: Northeast United Register 1-1 Draw Against FC Goa",
      "link": "https://www.latestly.com/agency-news/sports-news-isl-northeast-united-register-1-1-draw-against-fc-goa-6566132.html",
      "description": "Get latest articles and stories on Sports at LatestLY. Mohammad Yasir had his fair share of luck when he handed the lead to the Gaurs but Jithin MS' 76th minute strike saw the Highlanders split points. This was the 11th draw between these two teams, the most number of stalemates between two teams in this competition's history, as per a press release from ISL.",
      "pubDate": "2025-01-15 03:32:23",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2018/03/default-img-01-784x441.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "ISL: NorthEast United FC, FC Goa share points after 1-1 draw",
      "link": "https://www.espn.in/football/story/_/id/43412006/isl-score-2024-25-indian-super-league-football-report-results-summary-schedule-matchweek-17",
      "description": "Here are the details for matchweek 17 of ISL 2024-25 with the latest match report coming first:",
      "pubDate": "2025-01-14 17:33:02",
      "image_url": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0114%2Fr1438371_1200x675_16-9.jpg",
      "source_name": "Espn India"
    },
    {
      "title": "How To Watch NorthEast United vs FC Goa, Live Streaming Online? Get Live Telecast Details of ISL 2024–25 Football Match With Time in IST",
      "link": "https://www.latestly.com/socially/sports/football/how-to-watch-northeast-united-vs-fc-goa-live-streaming-online-get-live-telecast-details-of-isl-2024-25-football-match-with-time-in-ist-6564202.html",
      "description": "Fifth-placed NorthEast United and fourth-ranked FC Goa will face each other in the Indian Super League 2024-25 on Tuesday, January 14. Scroll down for more details of the NorthEast United vs FC Goa match live streaming.",
      "pubDate": "2025-01-14 13:45:03",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2024/10/14-148-1-380x214.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "NorthEast United vs FC Goa, ISL 2024–25 Live Streaming Online on JioCinema: Watch Telecast of NEUFC vs FCG Match in Indian Super League 11 on TV and Online",
      "link": "https://www.latestly.com/sports/football/northeast-united-vs-fc-goa-isl-2024-25-live-streaming-online-on-jiocinema-watch-telecast-of-neufc-vs-fcg-match-in-indian-super-league-11-on-tv-and-online-6564269.html",
      "description": "Alaaeddine Ajaraie has been the standout performer for NorthEast United in attack and his ability to cut inside and score and create chances makes him special. He will be supported by Macarton Louis Nickson and Jithin MS in the final third. Gullermo is likely to be picked for the lone striker role.",
      "pubDate": "2025-01-14 09:39:40",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2024/10/14-148-1-380x214.jpg",
      "source_name": "Latestly"
    }

  ]
}