{
  "results": [
    {
      "title": "Kerala Blasters FC raises concerns over turf damage at JLN stadium; Home match on Monday in doubt",
      "link": "https://www.newindianexpress.com/states/kerala/2025/Jan/11/kerala-blasters-fc-raises-concerns-over-turf-damage-at-jln-stadium-home-match-on-monday-in-doubt",
      "pubDate": "2025-01-11 16:02:25",
      "image_url": "https://media.assettype.com/TNIE/import/2023/10/4/original/kerala_blasters_EPS2111620.jpg",
      "source_name": "The New Indian Express"
    },
    {
      "title": "ISL 2024-25: Kerala Blasters raises concerns over Kochi stadium pitch condition after world-record dance event",
      "link": "https://sportstar.thehindu.com/football/indian-football/isl-2024-25-kerala-blasters-kochi-jawaharlal-nehru-stadium-pitch-conditions-guiness-world-record-event-news/article69089637.ece",
      "description": "But a mass dance event on December 29, which saw around 12,000 Bharatanatyam dancers on the stadium ground in a bid to break the Guinness World record, appears to have messed up the pitch.",
      "pubDate": "2025-01-11 15:34:32",
      "image_url": "https://ss-i.thgim.com/public/incoming/205b8r/article69089638.ece/alternates/LANDSCAPE_1200/Kaloor%20Stadium%20new.jpg",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "ISL | AIFF disciplinary committee changes Aiban’s red card to yellow after KBFC’s appeal",
      "link": "https://www.thehindu.com/sport/football/isl-aiff-disciplinary-committee-changes-aibans-red-card-to-yellow-after-kbfcs-appeal/article69085199.ece",
      "description": "Aiban is now eligible to play in Blasters’ next match against Odisha FC in Kochi on January 13",
      "pubDate": "2025-01-10 13:08:53",
      "image_url": "https://th-i.thgim.com/public/sport/74ss6u/article69085192.ece/alternates/LANDSCAPE_1200/aiban.jpg",
      "source_name": "The Hindu"
    },
    {
      "title": "Rahul KP joins Odisha on permanent deal",
      "link": "https://timesofindia.indiatimes.com/city/bhubaneswar/rahul-kp-joins-odisha-on-permanent-deal/articleshow/117002458.cms",
      "description": "To enhance their attacking prowess, Indian Super League (ISL) side Odisha FC has signed talented India forward Rahul KP. The Thrissur-born winger joins the Kalinga Warriors from Kerala Blasters FC on a permanent transfer, committing to the Bhubaneswar-based club until the end of the 2026-27 season, with an option to extend for an additional year.\n\nWelcoming the 24-year-old to the squad, Odisha FC head coach Sergio Lobera expressed his excitement. “Rahul is a player who fits very well into our playing style. I’m confident he will help us improve, and I’m happy with his arrival,” Lobera said in a statement.\n\nRahul, equally enthusiastic about the move, shared his thoughts on beginning a new chapter at Kalinga Stadium. “I’m ready for this new challenge. Odisha FC is the only team that showed interest in me, so I’m super happy to be here. Most importantly, it’s the coach’s call, which makes it even more amazing. I’m here to give my best, learn, and grow. The rest I leave to God,” he said.\n\nRahul joins Odisha FC after an impressive start to the 2024-25 season with Kerala Blasters, where he made 11 appearances and scored his first goal of the season in a commanding 3-0 win over Chennaiyin FC on November 24, 2024. Since joining the Blasters in 2019, he has played 89 matches across competitions, contributing over 10 goals and becoming a key figure for the Yellow Army.\n\nRahul’s football journey began in his hometown of Thrissur, where he shone at the FIFA U-17 World Cup before making his professional debut with Indian Arrows in the 2017-18 I-League. Now, with Odisha FC, he looks forward to elevating his game and making an impact under Lobera’s guidance.",
      "pubDate": "2025-01-06 18:08:57",
      "image_url": "https://static.toiimg.com/thumb/msid-117002453,width-1070,height-580,imgsize-26332,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "source_name": "The Times Of India"
    },

    {
      "title": "As goals dry up, Sadiku treasures team wins",
      "link": "https://timesofindia.indiatimes.com/city/goa/as-goals-dry-up-sadiku-treasures-team-wins/articleshow/117034266.cms",
      "description": "When Armando Sadiku learned that Mohun Bagan Super Giant planned to sign a new foreign striker, he was determined to fight for his place and complete his contract. However, staying in Kolkata seemed challenging given the club's decision. Despite this, Sadiku was not ready to give up.\n\nThen came a call from FC Goa, and coach Manolo Marquez—whom Sadiku knew well from their time at Las Palmas in Spain—personally reached out to him. It didn’t take long for Sadiku to decide. Within 30 minutes, he informed Mohun Bagan that he was ready to terminate his contract and join Goa. Neither the club nor the Albanian striker has looked back since.\n\nSadiku had a dream start with Goa, scoring in every match: pre-season friendlies, the Bhausaheb Bandodkar Memorial Trophy, and the first eight games of the Indian Super League (ISL). However, a minor injury kept him on the bench during an away game against Kerala Blasters as a precaution.\n\nSince then, it has been a month without a goal for Sadiku, with his last coming in a home win against Punjab FC. To be fair, he has started only two of the five games played during this period, as Manolo rotates his foreign forwards to maintain focus and fitness.\n\n“When I’m on the pitch, I try my best to help my teammates and score goals,” Sadiku said during a pre-match interaction on Tuesday. “Sometimes I score, sometimes I don’t, but I always give my best for the team. When the team wins, we’re all happy.”\n\nSadiku credited his success at Goa to the team’s clear playing style, something he found lacking at Mohun Bagan despite winning the Shield and reaching the ISL final there. “Here, every player knows their role on the field, and we understand how to play. I’m personally very happy,” he added.\n\nGoa is now on an impressive eight-match unbeaten run, winning seven games and drawing once against Bengaluru FC, whom they later defeated 3-0 at home, with Sadiku opening the scoring. This strong form has raised hopes of challenging favourites Mohun Bagan for the Shield. Sadiku believes they can.\n\n“We know we have the potential to win the Shield,” Sadiku said confidently. “Mohun Bagan has excellent individual players, but here in Goa, we have a strong team. We’re united, and right now, it’s going to be very difficult for any team to beat us.”\n\nSadiku, who famously scored Albania’s first-ever goal at Euro 2016, has played in Switzerland, Spain, Poland, Turkey, Liechtenstein, and even Bolivia. But at 33, he feels something special in Goa.\n\n“I’ve been in many dressing rooms, but this one is fantastic. We have great teammates, and we enjoy our time together. I’m very happy to be part of this group,” Sadiku shared.",
      "pubDate": "2025-01-07 19:02:27",
      "image_url": "https://static.toiimg.com/thumb/msid-117034261,imgsize-277194,width-400,height-225,resizemode-72/117034261.jpg",
      "source_name": "The Times Of India"
    },
    {
      "title": "ISL 2024-25: Pramveer Singh, the league’s youngest starter, aims to kick on for Punjab FC",
      "link": "https://sportstar.thehindu.com/football/indian-football/pramveer-singh-indian-super-league-youngest-starter-isl-2024-25-punjab-fc-football-news/article69073400.ece",
      "description": "At just 17 years and 189 days old, Punjab FC’s Pramveer Singh made history as the youngest starter in 11 seasons of the Indian Super League (ISL). His debut came on December 26 against Mohun Bagan Super Giant at the Jawaharlal Nehru Stadium.\n\nDespite Punjab FC’s 3-1 defeat, the lanky centre-back from Haryana left a strong impression. With four interceptions and a block, he earned the trust of his coach, who started him in the next game against Kerala Blasters.\n\nPramveer’s opportunity arose due to an injury to Croatian centre-back Ivan Novoselec during a game against East Bengal. Now, after getting his first taste of top-flight football, the left-footed defender is determined to become a key player for his team.\n\n“I felt I was ready, but it was against a very big team like Mohun Bagan,” Pramveer said, speaking to Sportstar on Tuesday. “I was scared that if I didn’t play well in my first match, the coach wouldn’t trust me, and getting another chance would be difficult. But I thought I did well. The coach told me to keep performing like that. My aim now is to become a regular starter for the club.”\n\nHailing from Behlba village in the Rohtak district, Pramveer’s journey into football wasn’t easy. His father, a farmer and former aspiring boxer, wanted him to pursue boxing or wrestling.\n\n“I started playing football in my village at the age of nine,” Pramveer recalled. “My parents weren’t supportive. My father wanted me to try boxing or wrestling. A lot of people in my neighborhood played football, but no one had made it professionally, so my parents didn’t see a future in it.”\n\nA breakthrough came in 2017 when Pramveer attended trials for Minerva Punjab FC, a former I-League team that now competes in the ISL as Punjab FC.\n\n“A couple of friends told me Minerva was holding trials. I was selected, and when the team became Punjab FC, I joined the academy,” he shared.\n\nPramveer has already represented India at the junior level, playing in the AFC U-20 Asian Cup Qualifiers in Laos last September. With a promising start to his career, the teenager is eager to continue making his mark in Indian football.",
      "pubDate": "2025-01-07 15:32:42",
      "image_url": "https://ss-i.thgim.com/public/incoming/ts3hrw/article69073467.ece/alternates/LANDSCAPE_1200/m69777.jpg",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "ISL 2024-25: Rahul KP Joins Odisha FC From Kerala Blasters For Remainder of Indian Super League Season",
      "link": "https://www.latestly.com/agency-news/sports-news-rahul-kp-leaves-kerala-blasters-to-sign-with-odisha-fc-6545688.html",
      "description": "Kerala Blasters FC (KBFC) have officially announced the departure of winger Rahul KP, who has joined Odisha FC (OFC) on a permanent deal. The 24-year-old Kerala native, a fan favorite for his local roots and passionate performances, leaves the Blasters after six memorable seasons.\n\nRahul joined Kerala Blasters in 2019 from Indian Arrows and quickly cemented his place in the senior team. Over the years, he grew into a key player, scoring nine goals in all competitions and becoming a beloved figure in yellow and blue.\n\nOn their X handle, KBFC shared, \"An agreement has been reached between Kerala Blasters FC and Odisha FC on the permanent transfer of Rahul KP. All of us at Kerala Blasters FC would like to thank Rahul for his contributions and for all the memories. We wish Rahul nothing but the best for his future.\"\n\nRahul has signed with the Kalinga Warriors until the end of the 2026-27 season, adding depth to head coach Sergio Lobera's attacking options. Lobera welcomed the new signing, saying, \"Rahul is a profile of player who can fit very well into our play style. I am sure he will help us improve. I am happy with his arrival.\"\n\nExpressing his excitement about the move, Rahul said on the Odisha FC website, \"I’m ready for this new challenge. Odisha FC is the only team that showed interest in me, so I am super happy to be here. Most importantly, it’s the coach’s call, which makes it even more amazing. I’m here to give my best, to learn and grow. The rest I leave to God.\"\n\nRahul now looks forward to making an impact with the Bhubaneswar-based club and contributing to their success under Lobera's leadership.",
      "pubDate": "2025-01-06 18:21:59",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2025/01/MixCollage-06-Jan-2025-11-44-PM-4832-380x214.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "ISL 2024-25: FC Goa looks to extend winning run against struggling Hyderabad FC",
      "link": "https://sportstar.thehindu.com/football/indian-football/isl-2024-25-fc-goa-vs-hyderabad-fc-preview-team-news-head-to-head-fcg-v-hfc-indian-super-league/article69072476.ece",
      "description": "FC Goa will aim to complete a season double over Hyderabad FC when it hosts the Nizams in their Indian Super League (ISL) 2024-25 clash at the Jawaharlal Nehru Stadium on Wednesday.  \n\nA victory with a clean sheet would be a significant milestone for the Gaurs, marking their first-ever streak of four consecutive shutouts in the ISL. It would also extend their winning run against Hyderabad FC to four games, the longest in their rivalry.  \n\nCurrently third in the table, FC Goa has 25 points from 13 matches, with seven wins and four draws. A win would propel them to second place, keeping their Shield aspirations alive.  \n\n“We have to be ambitious. The target is to win the Shield. If that doesn’t happen, at least we aim to finish in the top two,” said FC Goa’s head coach, Manolo Marquez. “We want to get points from this match.”  \n\nMeanwhile, Hyderabad FC is looking to end a challenging streak of three consecutive away losses without scoring. Sitting second from bottom with just eight points from 14 matches, the Nizams are desperate for a turnaround. A win would break their winless run since November 2024, when they defeated Kerala Blasters 2-1 on the road.  \n\n“There are some key players in FC Goa we’ve analyzed. We’ll try to stop them. The focus is to get points from this match,” said Hyderabad FC’s interim head coach, Shameel Chembakath.  \n\nThe head-to-head record between these teams favors FC Goa, with six wins in their 11 encounters. Hyderabad has managed three victories, while two games ended in draws.",
      "pubDate": "2025-01-07 12:57:12",
      "image_url": "https://ss-i.thgim.com/public/incoming/1hv7uh/article69072507.ece/alternates/LANDSCAPE_1200/DSC00011.JPG",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "ISL 2024-25, Winter Transfer Window: East Bengal FC Ropes In Richard Enrique Celis Sanchez",
      "link": "https://www.outlookindia.com/sports/football/isl-january-2025-transfer-window-all-the-completed-moves-in-indian-super-league",
      "pubDate": "2025-01-07 11:34:15",
      "image_url": "https://media.assettype.com/outlookindia/2025-01-07/aty9l0gu/Richard-Enrique-Celis-Sanchez-X-file.jpg?ar=40%3A21&auto=format%2Ccompress&enlarge=true&mode=crop&ogImage=true&overlay=false&overlay_position=bottom&overlay_width=100&w=1200",
      "source_name": "Outlook"
    }

  ]
}