{
  "results": [
    {
      "title": "Mega Guinness Dance Event: GCDA engineer SS Usha suspended to save face",
      "link": "https://keralakaumudi.com/en/news/kerala/general/mega-guinness-dance-event-gcda-engineer-ss-usha-suspended-to-save-face.-1455706",
      "description": "KOCHI: The GCDA (Greater Cochin Development Authority) is in trouble over the security lapse and the release of the Kaloor Jawaharlal Nehru Stadium for the mega dance event that led to the accident of Uma Thomas MLA. GCDA site engineer SS Usha has been suspended to save face. GCDA chairman K Chandranpillai is also being accused. It is alleged that the interference of the chairman is behind the Kerala Blasters home ground stadium being released for the Guinness dance.\n\nCheshire, a native of Kochi, filed a complaint with the Vigilance, demanding a comprehensive investigation against the organizers Mridanga Vision and K Chandranpilla, who gave permission to release the stadium. This was handed over to the Vigilance Chief.\n\nThe charge against Usha is that the stadium was not inspected adequately. GCDA Secretary Indu Vijayan will investigate this. The GCDA meeting held that the permission of the Corporation should have been taken. Youth Congress workers stormed the meeting. Nine Youth Congress workers were arrested for trying to assault K Chandranpillai.",
      "pubDate": "2025-01-04 18:11:03",
      "image_url": "https://keralakaumudi.com/web-news/en/2025/01/NMAN0556833/image/uma-thomas.1.3068041.webp",
      "source_name": "Kerala Kaumudi Online"
    },
    {
      "title": "ISL 2024-25: Depleted Punjab FC Aim For League Double Over Kerala Blasters",
      "link": "https://www.freepressjournal.in/sports/isl-2024-25-depleted-punjab-fc-aim-for-league-double-over-kerala-blasters",
      "description": "Punjab FC will aim to complete a league double over Kerala Blasters FC as the Shers will welcome the Tuskers in the Indian Super League (ISL) 2024-25 fixture which will be played at the Jawaharlal Nehru Stadium here on Sunday.\n\nPunjab FC started the season with an emphatic 2-1 victory away at Kochi and will look to emulate that performance to climb up into the playoff positions in the table. Punjab currently occupy the eighth position in the table with 18 points while the Blasters are two places below with 14 points.\n\nSpeaking ahead of the match, PFC head coach Panagiotis Dilmperis said about the recent results of the team, \"We did not play badly in these matches but the results were not that we expected. Tomorrow's match is a new challenge and we will take the field with new vigour.\n\nMy players are hungry and confident and I hope that they will put their best foot forward.\" Both teams haven't had favourable results going into the first match of the New Year.",
      "pubDate": "2025-01-04 16:39:52",
      "image_url": "https://media.assettype.com/freepressjournal/2025-01-04/0evkyu3n/Punjab-FC-vs-Kerala-Blasters.jfif",
      "source_name": "The Free Press Journal"
    },
    {
      "title": "GCDA Chairman, officials overlooked dissent note by estate superintendent against renting out stadium for dance event",
      "link": "https://www.thehindu.com/news/national/kerala/gcda-chairman-officials-overlooked-dissent-note-by-estate-superintendent-against-renting-out-stadium-for-dance-event/article69061118.ece",
      "description": "Documents have emerged showing that the Greater Cochin Development Authority (GCDA) had rented out the Jawaharlal International Stadium at Kaloor to Mridanga Vision, organisers of the mass dance event where Uma Thomas, MLA, had a horrific fall, disregarding a file noting by its estate superintendent.\n\nRTI activist Cheshire Tarzan, who had secured the relevant documents, has lodged a complaint with the Ernakulam unit of the Vigilance and Anti-Corruption Bureau (VACB) seeking a probe into the alleged conspiracy and corruption involving GCDA Chairman K. Chandran Pillai and the officials concerned in renting out the stadium for a non-sporting event.\n\nMridanga Vision managing director M. Nigoshkumar had reportedly requested the stadium on rent on September 24, 2024. In response, estate superintendent Sini K.A. noted in the file that the stadium had been allotted to the Indian Super League team Kerala Blasters FC for home matches from September 2024 to April 2025. “Since the turf has to be maintained as per international standards as required by FIFA and at present the stadium is allotted only for football matches, the applicant may be informed that his request cannot be considered. As the applicant has written to the GCDA Chairman, this may also be brought to the notice of the Chairman,” she said.\n\nHowever, the estate manager reportedly ignored the note and signed the file. On October 15, 2024, the GCDA secretary allegedly noted in the file that the stadium could be allotted once the organisers obtained a no-objection certificate from Kerala Blasters FC. On the same day, Mr. Pillai allegedly remarked in the file that, as the programme was planned outside the turf, the stadium could be allotted with a rent of ₹9 lakh and a deposit of ₹5 lakh. Mridanga Vision reportedly transferred ₹13 lakh to the GCDA’s bank account the same day.\n\n“But the Chairman unilaterally decided to allot the stadium even before the organisers provided a consent letter from the Kochi Corporation or no-objection certificates from the Fire and Rescue Services department and the police. Mridanga Vision had directly approached the Chairman, and their request was forwarded to the estate wing with his signature. Typically, such applications are processed by creating a file, which is first examined by the estate wing and the secretary before reaching the Chairman. The executive committee then decides on the allotment and fixes the rent,” said Mr. Tarzan.\n\nThe conditions set by the GCDA for allotting the stadium specify that temporary structures could be constructed only after obtaining prior approvals from the Corporation and the Fire and Rescue Services.\n\nMoreover, the GCDA has not issued a notice to the organisers despite the serious injuries Ms. Thomas sustained from falling off the makeshift stage in the gallery. Mr. Tarzan also alleged that the Corporation incurred financial losses due to the Revenue Inspector’s failure to intervene, even though the event was widely advertised.\n",
      "pubDate": "2025-01-04 16:22:53",
      "image_url": "https://www.thehindu.com/theme/images/og-image.png",
      "source_name": "The Hindu"
    },
    {
      "title": "Premier League 2024-25: Newcastle fights back to secure 2-1 victory at Tottenham",
      "link": "https://sportstar.thehindu.com/football/epl/premier-league-2024-25-newcastle-fights-back-secure-2-1-vs-tottenham-hotspur-highlights-report-result-score/article69062095.ece",
      "description": "Newcastle United striker Alexander Isak continued his rich vein of form with another goal on Saturday to help his side beat injury-hit Tottenham Hotspur 2-1 away in the Premier League and move closer to the top four.",
      "pubDate": "2025-01-04 14:57:04",
      "image_url": "https://ss-i.thgim.com/public/incoming/n60ofj/article69062108.ece/alternates/LANDSCAPE_1200/2025-01-04T144040Z_245305440_UP1EL1411MPP2_RTRMADP_3_SOCCER-ENGLAND-TOT-NEW-REPORT.JPG",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "ISL 2024-25: Punjab FC looks to overcome defensive woes against struggling Kerala Blasters",
      "link": "https://sportstar.thehindu.com/football/indian-football/punjab-fc-vs-kerala-blasters-preview-isl-2024-25-squad-team-injury-suspension-points-table-standings-pfc-v-kbfc-news/article69061921.ece",
      "description": "For Punjab FC, the Indian Super League (ISL) 2024-25 season is at the halfway stage. The results so far have been a mixed bag, with 12 games yielding six wins and losses each. Three of these defeats came in succession in December, a streak that it would look to shake off when it takes on Kerala Blasters at the JLN Stadium here on Sunday.\n\nFor that to happen, it will have to iron out shortcomings in the defence. Besides conceding nine goals in its last three matches, there were also red cards to Khaiminthang Lhungdim against East Bengal and Ezequiel Vidal against Mohun Bagan which didn’t help its cause.\n\n“After losing three games, of course you can’t be happy or satisfied,” Punjab coach Panagiotis Dilmperis said at the pre-match press conference on Saturday. “But it is the same as when we had three wins in a row. It is a new game. It is a different challenge. We have to approach it this way.”\n\nCompounding matters for Punjab are the overseas absentees. While Vidal and Luka Majcen are suspended, there are injuries to the Croatian duo of Ivan Novoselec and Filip Mrzljak.\n\nBlasters, who lost their previous game to Jamshedpur, have their fair share of concerns too. Languishing in 10th on the points table, two spots below Punjab, Blasters have registered only four wins in 14 matches.",
      "pubDate": "2025-01-04 14:14:34",
      "image_url": "https://ss-i.thgim.com/public/incoming/mi49sv/article69061894.ece/alternates/LANDSCAPE_1200/2S3_9538.JPG",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "Punjab FC vs Kerala Blasters, ISL 2024-25: Match Preview, Live Streaming, Predicted XI and Full Squads",
      "link": "https://www.news18.com/football/punjab-fc-vs-kerala-blasters-isl-2024-25-live-streaming-match-preview-squads-lineups-probable-xi-9176351.html",
      "description": "Punjab FC are desperate to bounce back in the Indian Super League (ISL), having suffered three defeats in a row. Since beating Mohammedan Sporting Club at home, Punjab have lost to Jamshedpur, East Bengal and Mohun Bagan Super Giant. Their defence have looked quite sloppy in all these matches. Punjab scored first against both East Bengal and Mohun Bagan but failed to maintain the lead till the final whistle. The Shers are now set to host Kerala Blasters in the next ISL game. The match will be played at the Jawaharlal Nehru Stadium in New Delhi on January 5, 2025.\n\nPunjab are now eighth in the league standings. They have collected 18 points from 12 matches, registering six victories. Kerala Blasters, on the other hand, have two games more than Punjab and are reeling at the tenth spot with 14 points. Kerala were up against Jamshedpur in the previous fixture and ended up losing by one goal. In their last five ISL appearances, Kerala have managed only one win which came against Mohammedan Sporting on home soil.",
      "pubDate": "2025-01-04 14:00:21",
      "image_url": "https://images.news18.com/ibnlive/uploads/2025/01/isl_punjab-fc-vs-kerala-blasters-2025-01-a5cd498e8486d74e877a89fb475effb6-3x2.jpg",
      "source_name": "News 18"
    },
    {
      "title": "ISL 2024-25: Depleted Punjab FC aim for league double over Kerala Blasters",
      "link": "https://yespunjab.com/isl-2024-25-depleted-punjab-fc-aim-for-league-double-over-kerala-blasters/",
      "description": "New Delhi, Jan 4, 2025- Punjab FC will aim to complete a league double over Kerala Blasters FC as the Shers will welcome the Tuskers in the Indian Super League (ISL) 2024-25 fixture which will be played at the Jawaharlal Nehru Stadium here on Sunday. Punjab FC started the season with an emphatic 2-1 victory [...]The post ISL 2024-25: Depleted Punjab FC aim for league double over Kerala Blasters appeared first on Yes Punjab News.",
      "pubDate": "2025-01-04 13:10:15",
      "image_url": "https://yespunjab.com/wp-content/uploads/2025/01/ISL-2024-25-Depleted-Punjab-FC-aim-for-league-696x497.jpg",
      "source_name": "Yes Punjab News"
    },
    {
      "title": "Sports News | Punjab FC Eye Better Show in Defense Against Kerala Blasters FC",
      "link": "https://www.latestly.com/agency-news/sports-news-punjab-fc-eye-better-show-in-defense-against-kerala-blasters-fc-6540513.html",
      "description": "Get latest articles and stories on Sports at LatestLY. Missing important attacking options, Punjab FC will look to defend well when they host Kerala Blasters FC in their Indian Super League match here on Sunday.",
      "pubDate": "2025-01-04 12:10:18",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2018/03/default-img-01-784x441.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "Punjab FC Vs Kerala Blasters FC Live Streaming, ISL 2024-25: When, Where To Watch Football Match",
      "link": "https://www.outlookindia.com/sports/football/punjab-fc-vs-kerala-blasters-fc-live-streaming-indian-super-league-2024-25-when-where-to-watch-isl-match-on-tv-and-online",
      "pubDate": "2025-01-04 11:34:22",
      "image_url": "https://media.assettype.com/outlookindia/2025-01-04/8gb2phu1/kerala-blasters-fc-X.jpg?ar=40%3A21&auto=format%2Ccompress&enlarge=true&mode=crop&ogImage=true&overlay=false&overlay_position=bottom&overlay_width=100&w=1200",
      "source_name": "Outlook"
    },
    {
      "title": "ISL 2024-25: Kerala Blasters forms Fan Advisory Board to discuss club performance among other topics",
      "link": "https://sportstar.thehindu.com/football/indian-football/kerala-blasters-forms-fan-advisory-board-to-discuss-performances-in-isl-2024-25-engagement/article69061195.ece",
      "description": "The announcement comes at a time when KBFC’s fan clubs have been at a standoff with the team’s top management amid poor results in the Indian Super league.",
      "pubDate": "2025-01-04 10:59:44",
      "image_url": "https://ss-i.thgim.com/public/incoming/8lu8b4/article69061211.ece/alternates/LANDSCAPE_1200/CBXH0075A.jpg",
      "source_name": "Sport Star The Hindu"
    }

  ]
}