{
  "results": [
    {
      "title": "Mishap at mass dance event may dampen GCDA’s bid to woo non-sporting events to stadium",
      "link": "https://www.thehindu.com/news/cities/Kochi/mishap-at-mass-dance-event-may-dampen-gcdas-bid-to-woo-non-sporting-events-to-stadium/article69057694.ece",
      "description": "The Greater Cochin Development Authority (GCDA) may have jeopardized the Jawaharlal Nehru International Stadium's future as an international sporting venue by renting it out for a mass dance event. This decision has raised concerns among sporting authorities, particularly FIFA, as it could negatively impact the stadium's eligibility to host international matches. \n\nThe primary concern revolves around the potential damage inflicted on the stadium's recently renovated turf by the presence of 12,000 dancers. While the GCDA claims adequate space was provided to prevent damage to the playing field, critics argue that the sheer number of people on the delicate turf could have severe consequences. The impact of this event will be assessed when the Kerala Blasters FC, the stadium's home team, inspects the ground before their next home game.\n\nThe GCDA had allocated a significant budget for turf protection tiles to attract non-sporting events to the stadium. However, this incident may hinder those efforts and cast doubt on the stadium's suitability for such events in the future. \n\nThe GCDA, on the other hand, defends its decision, emphasizing the economic benefits of hosting such events for the city. They argue that the influx of over 12,000 dancers and their families would have boosted the local economy. \n\nThis incident highlights the delicate balance between utilizing a premier sporting venue for diverse events and preserving its integrity for international competitions. \n",
      "pubDate": "2025-01-03 14:00:32",
      "image_url": "https://th-i.thgim.com/public/incoming/rl1rss/article69058155.ece/alternates/LANDSCAPE_1200/Stadium02.jpg",
      "source_name": "The Hindu"
    },
    {
      "title": "ISL 2024-25: Mohun Bagan Super Giant Thump Hyderabad FC 3-0 To Notch Up Sixth Straight Home Win",
      "link": "https://www.latestly.com/sports/football/isl-2024-25-mohun-bagan-super-giant-thump-hyderabad-fc-3-0-to-notch-up-sixth-straight-home-win-6536627.html",
      "description": "Mohun Bagan Super Giant's victory over Hyderabad FC in the Indian Super League. It discusses the match highlights. Mohun Bagan Super Giant started the game with great zeal, looking to progress the ball forward at every opportunity. They played at a high intensity which Hyderabad FC could not match in the initial exchanges. The Mariners were rewarded for their dominant start in the ninth minute when they grabbed the lead courtesy of an own goal conceded by Stefan Sapic. They kept pushing for the second goal as they found acres of space in Hyderabad FC's final third. Their efforts bore fruit in the 41st minute when Aldred doubled the lead with a diving header following Liston's pinpoint delivery inside the box. The hosts continued their dominance into the second half with Cummings getting into the scoresheet in the 51st minute.",
      "pubDate": "2025-01-02 16:57:13",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2025/01/39-141-380x214.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "Dance programme at Kaloor stadium: GCDA and Blasters to inspect ground, will seek compensation from Mridanga Vision",
      "link": "https://keralakaumudi.com/en/news/kerala/general/dance-programme-at-kaloor-stadium-gcda-and-blasters-to-inspect-ground-will-seek-compensation-from-mridanga-vision-1454249",
      "description": "The organizers of the recent mega dance event in Kochi are facing increasing pressure following the incident in which MLA Uma Thomas sustained severe injuries after falling from the stage. The Greater Cochin Development Authority (GCDA) and Kerala Blasters FC officials have announced plans to inspect the Kaloor Stadium to determine if any damage occurred to the ground due to the event. If any damage is found, the authorities stated they would seek compensation from the event organizers, Mridanga Vision. The inspection will be jointly conducted by GCDA engineers and Blasters officials. The GCDA also mentioned that they had discussed the matter with the Blasters.\n\nA caravan was brought onto the turf, and dancers stood near the touchline, with Divya Unni performing in the centre of the field. The GCDA pointed out that this caused damage to the ground. They added that since the stadium is the home ground of the Blasters, it is generally not rented out for non-sporting events to prevent such damage.\n\nMeanwhile, Nighosh Kumar, the owner of Mridanga Vision, surrendered to the police in connection with the incident where MLA Uma Thomas sustained severe injuries. Nighosh Kumar surrendered at the Palarivattom Police Station. The High Court had previously instructed Kumar to appear before the police by 2 PM today. The police had planned to arrest him if he failed to comply with the court's directive. The CEO of Mridanga Vision had earlier informed authorities that Kumar was responsible for overseeing all operations related to the event.",
      "pubDate": "2025-01-02 14:58:34",
      "image_url": "https://keralakaumudi.com/web-news/en/2025/01/NMAN0556283/image/gcda.1.3073390.webp",
      "source_name": "Kerala Kaumudi Online"
    },
    {
      "title": "GCDA and KBFC to inspect Kaloor stadium for damages after Divya Unni’s dance event",
      "link": "https://english.mathrubhumi.com/news/kerala/kaloor-stadium-divya-unni-mega-dance-event-controversy-1.10217364",
      "description": "The officials from the Greater Cochin Development Authority (GCDA) and Kerala Blasters FC will conduct an inspection of Kaloor Stadium, the venue where Congress MLA Uma Thomas suffered severe injuries after falling from a temporary stage during a major dance event.\n\nThe inspection will determine if the event caused any damage to the stadium's surface. GCDA has indicated that they will seek compensation from the event organizers, Mridanga Vision. A joint assessment involving engineers from both GCDA and Blasters officials is scheduled to take place.\nReports indicate that the caravan was driven onto the turf during the event, while dancers lined up as far as the touchline with actress Divya Unni performing in the center of the ground. GCDA claims these activities may have caused significant damage to the stadium’s surface. Emphasizing that the venue is the home ground of Kerala Blasters, the GCDA reiterated its policy of limiting non-sporting events to avoid such damage.\n\nThe event, organized to achieve a Guinness World Record, faced backlash after MLA Uma Thomas suffered severe injuries from a fall off a temporary stage erected inside the stadium. The incident has further fueled controversies surrounding the event’s organization.\n\nThe organizers, Mridanga Vision, are now under investigation for alleged financial irregularities. Cases have been filed against the company's MD, M. Nigosh Kumar, CEO Shamir, Purnima, and Nighosh Kumar’s wife, on charges of criminal breach of trust. Authorities have frozen the company’s bank accounts.\n\nCity Police Commissioner Putta Vimaladitya indicated that actress Divya Unni might be summoned for questioning in connection with the case. Amid speculation about her potential testimony, Divya reportedly left for the United States on Wednesday.\n\nThe complaint was lodged by Biji Hilal, a resident of Thrikkakara and the mother of a dancer who participated in the event. She alleged that the organizers collected money from participants, promising them Guinness World Record recognition and certificates, but failed to deliver on these assurances.",
      "pubDate": "2025-01-02 12:46:54",
      "image_url": "https://english.mathrubhumi.com/image/contentid/policy:1.10217325:1735817660/divya-unni.jpg?%24p=242c2aa&f=16x10&q=0.8&w=852",
      "source_name": "Mathrubhumi English"
    },
    {
      "title": "ISL 2024-25 Transfer News: Mumbai City FC Sign Kerala Blasters Defender Prabir Das On Loan For Rest Of The Season",
      "link": "https://www.freepressjournal.in/sports/isl-2024-25-transfer-news-mumbai-city-fc-sign-kerala-blasters-defender-prabir-das-on-loan-for-rest-of-the-season",
      "description": "Kerala Blasters defender Prabir Das has joined Mumbai City FC on loan for the rest of the Indian Super League (ISL) 2024-25 season. Das a two-time ISL winner with ATK and I-League champion with Mohun Bagan, has endured a tough start at Kerala Blasters since moving from Bengaluru FC on a free transfer ahead of the 2023-24 campaign.\n\nInjuries hampered his game time at Blasters across two seasons. In his first season,n Prabir made eight appearances. However, in the ongoing season, he has managed to make just one appearance against his former club Bengaluru in a match which ended 4-2 in favour of the Blues.\n\nHow does Prabir Das transfer help Mumbai City FC & Kerala Blasters?\n\nMumbai City FC, currently sitting seventh in the ISL 2024-25 table are under pressure to secure a playoff spot. By signing Prabir Das coach Petr Kratky gets a player who can bring in versatility to the squad. ",
      "pubDate": "2025-01-02 12:09:51",
      "image_url": "https://media.assettype.com/freepressjournal/2025-01-02/5h1wyo2m/prabir-2.jfif",
      "source_name": "The Free Press Journal"
    },
    {
      "title": "Players and teams ruling the roost in the 2024-25 ISL season",
      "link": "https://www.dnaindia.com/sports/report-players-and-teams-ruling-the-roost-in-the-2024-25-isl-season-3125118",
      "description": "2024-25 ISL: Despite dwindling attendances, India's top-tier league boasts of high-quality attackers and goalkeepers.",
      "pubDate": "2025-01-01 07:09:00",
      "image_url": "https://cdn.dnaindia.com/sites/default/files/styles/third/public/2025/01/01/2669631-article.jpg",
      "source_name": "Dna"
    },
    {
      "title": "ISL Musings: Unstoppable Bagan, Blasters lurch from one crisis to another, NorthEast's style and substance",
      "link": "https://www.espn.in/football/story/_/id/43234579/isl-musings-2024-25-indian-super-league-football-mw14-mohun-bagan-unstoppable-kerala-blasters-crisis-northeast-style",
      "description": "Plus, where do Mumbai City go, Odisha don't look like a Lobera team, BFC's attacking might and more from matchweek 14.",
      "pubDate": "2024-12-31 13:32:29",
      "image_url": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1231%2Fr1433482_1296x729_16-9.jpg",
      "source_name": "Espn India"
    },
    {
      "title": "ISL Musings: Unstoppable Bagan, Blasters lurch from one crisis to another, NorthEast's style and substance",
      "link": "https://www.espn.in/football/story/_/id/43234579/isl-musings-2024-25-indian-super-league-football-mw14-mohun-bagan-unstoppable-kerala-blasters-crisis-northeast-style",
      "description": "Plus, where do Mumbai City go, Odisha don't look like a Lobera team, BFC's attacking might and more from matchweek 14.",
      "pubDate": "2024-12-31 13:32:29",
      "image_url": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1231%2Fr1433482_1296x729_16-9.jpg",
      "source_name": "Espn India"
    }

  ]
}