{
  "results": [
    {
      "title": "Indian Super League (ISL) 2024-25: Kerala Blasters eye third straight win against NorthEast United FC",
      "link": "https://www.sentinelassam.com/sports-news/indian-super-league-isl-2024-25-kerala-blasters-eye-third-straight-win-against-northeast-united-fc",
      "description": "Kochi: Kerala Blasters FC will host NorthEast United FC in the Indian Super League (ISL) 2024-25 at the Jawaharlal Nehru Stadium on Saturday. Kerala Blasters have a chance to assert their superiority at home, since they have won their last two games in the stadium and have a chance to make it three consecutive victories in their backyard for the first time since the 2022-23 season. \n Kerala Blasters have won four out of their eight home games this season. A triumph will also extend their unbeaten home run against NorthEast United FC to nine encounters.\n\nNorthEast United have been prolific on the road, winning their last two away matches on the bounce and have four wins in their eight away fixtures in ISL 2024-25 and have the chance to correct their disappointing run in Kochi thus far.\n\nKerala Blasters are ninth in the table with 20 points from 16 matches, courtesy of six wins and two draws. They have won thrice and lost twice in their last five games.\n\nNorthEast United are fifth in the standings with 24 points from 16 matches. The Highlanders are unbeaten in their last five games but have won just twice and drawn thrice in a row.\n\nKerala Blasters have scored exactly thrice in both of their last two home matches. Another high-scoring victory will see them scale three consecutive home wins with 3+ goals for the first time in ISL history. After two consecutive away wins, another win on the road will also mark NorthEast United FC’s longest overall unbeaten streak since an 11-game stretch between January and March 2021. They are only three points behind the second-placed FC Goa (24) and could look to bridge that gap moving forward.\n\nThe Highlanders have scored 31 goals this season, the joint-highest tally in the league and will look to trouble the Kerala Blasters FC defence, which has conceded 27 strikes so far. Ajaraie has led the charts with 20 goal contributions, whereas Jithin M.S. has made five assists.\n\nKerala Blasters FC interim head coach TG Purushothaman stressed the importance of teamwork.\n\n“We play for each other. We believe in teamwork. We know how to deal with different situations and we will try to keep the positive results,” he said.\n\nNorthEast United FC head coach Juan Pedro Benali explained that his team will look to finish in the best possible position. “Regardless of if we play home or away, we have to take points. Last few games, we could take only one point, but it’s better than nothing. Now we have to try and win as much as possible and finish in the best spot,” he said. IANS",
      "pubDate": "2025-01-18 05:52:28",
      "image_url": "https://media.assettype.com/sentinelassam-english%2F2025-01-18%2Ftosqrs7o%2FKerala-Blasters.webp?ar=40%3A21&auto=format%2Ccompress&enlarge=true&mode=crop&ogImage=true&overlay=false&overlay_position=bottom&overlay_width=100&w=1200",
      "source_name": "The Sentinel"
    },
    {
      "title": "Sports News | Kerala Blasters FC Target Third Straight Win, as NorthEast United FC Aim to Break Streak of Three Draws",
      "link": "https://www.latestly.com/agency-news/sports-news-kerala-blasters-fc-target-third-straight-win-as-northeast-united-fc-aim-to-break-streak-of-three-draws-6574435.html",
      "description": "Get latest articles and stories on Sports at LatestLY. Kerala Blasters FC (KBFC) will play NorthEast United FC (NEUFC) in the Indian Super League (ISL) 2024-25 on Saturday, at the Jawaharlal Nehru Stadium, Kochi, at 7:30 pm IST.",
      "pubDate": "2025-01-18 04:10:26",
      "image_url": "https://st1.latestly.com/wp-content/uploads/2025/01/ANI-20250118035151-380x214.jpg",
      "source_name": "Latestly"
    },
    {
      "title": "Kerala Blasters vs NorthEast United FC LIVE streaming info, ISL 2024-25: When, where to watch KBFC v NEUFC?",
      "link": "https://sportstar.thehindu.com/football/indian-football/kerala-blasters-vs-northeast-united-fc-live-streaming-info-kbfc-v-neufc-isl-2024-25-tv-channel/article69110548.ece",
      "description": "Despite dominating possession against Odisha, the Blasters lacked the killer punch upfront till a three-goal blitz in the second half swung the match in its favour.",
      "pubDate": "2025-01-18 01:30:00",
      "image_url": "https://ss-i.thgim.com/public/incoming/h5ecq9/article69110557.ece/alternates/LANDSCAPE_1200/80968_13_1_2025_21_45_39_1_IMG_20250113_212217.JPG",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "Epic Showdown: Kerala Blasters vs. NorthEast United in ISL Clash",
      "link": "https://www.devdiscourse.com/article/sports-games/3229494-epic-showdown-kerala-blasters-vs-northeast-united-in-isl-clash",
      "description": "Kerala Blasters FC will host NorthEast United FC in a crucial Indian Super League 2024-25 match on Saturday at Kochi's Jawaharlal Nehru Stadium, starting at 7:30 pm IST. With recent successes at home, Kerala Blasters FC looks to maintain their dominance, having secured victories in their last two home games.",
      "pubDate": "2025-01-17 23:15:38",
      "image_url": "https://devdiscourse.blob.core.windows.net/devnews/18_01_2025_10_15_30_51474.jpg",
      "source_name": "Devdiscourse"
    },
    {
      "title": "ISL: Eze equaliser helps Jamshedpur FC draw with Mohun Bagan",
      "link": "https://telanganatoday.com/isl-eze-equaliser-helps-jamshedpur-fc-draw-with-mohun-bagan",
      "description": "The 1-1 draw in ISL helps 'Men of Steel' move to second spot, eight points behind the Mariners (36), with an extra game in hand",
      "pubDate": "2025-01-17 19:10:22",
      "image_url": "https://media.telanganatoday.com/wp-content/uploads/2025/01/Jamshedpur-FC-768x450.jpg",
      "source_name": "Telangana Today"
    },
    {
      "title": "ISL 2024-25: Kerala Blasters and mutually parts ways with French midfielder Alexandre Coeff",
      "link": "https://sportstar.thehindu.com/football/indian-football/isl-2024-25-kerala-blasters-mutually-terminates-contract-with-france-midfielder-alexandre-coeff/article69110212.ece",
      "description": "Kerala Blasters has mutually parted ways with French midfielder Alexandre Coeff, the Indian Super League (ISL) 2024-25 club said in an official statement on Friday.",
      "pubDate": "2025-01-17 16:11:41",
      "image_url": "https://ss-i.thgim.com/public/incoming/mcx4w5/article69110220.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202025-01-17%20at%209.35.50%20PM.jpeg",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "ISL 2024-25: Resurgent Blasters look to continue its good run against NorthEast United",
      "link": "https://sportstar.thehindu.com/football/indian-football/kerala-blasters-vs-northeast-united-isl-2025-preview-kbfc-v-neufc-match-updates-news/article69109314.ece",
      "description": "NorthEast United, which is currently unbeaten in its last five matches, will be more threatening than the passive Odisha side which blundered by trying to preserve its early lead in the previous encounter.",
      "pubDate": "2025-01-17 13:38:55",
      "image_url": "https://ss-i.thgim.com/public/incoming/tocojo/article69109261.ece/alternates/LANDSCAPE_1200/80968_13_1_2025_21_47_28_1_IMG_20250113_213524.JPG",
      "source_name": "Sport Star The Hindu"
    },
    {
      "title": "ISL 2024-25: Kerala Blasters hope to maintain winning steak",
      "link": "https://www.deccanherald.com/sports/football/isl-2024-25-kerala-blasters-hope-to-maintain-winning-steak-3360593",
      "pubDate": "2025-01-17 12:56:54",
      "image_url": "https://images.deccanherald.com/deccanherald%2F2025-01-17%2Fgy6oeotl%2Fblasters.jpg?ar=40%3A21&auto=format%2Ccompress&mode=crop&ogImage=true&rect=0%2C77%2C2048%2C1075&w=1200",
      "source_name": "Deccan Herald"
    },
    {
      "title": "Kerala Blasters FC vs NorthEast United FC, ISL 2024-25: Match Preview, Live Streaming, Predicted XI and Full Squads",
      "link": "https://www.news18.com/football/kerala-blasters-fc-vs-northeast-united-fc-isl-2024-25-live-streaming-match-preview-squads-lineups-probable-xi-9192513.html",
      "description": "ISL 2024-25: Kerala Blasters FC and NorthEast United FC face off at the Jawaharlal Nehru Indoor Stadium in Kochi.",
      "pubDate": "2025-01-17 12:24:20",
      "image_url": "https://images.news18.com/ibnlive/uploads/2025/01/isl_kerala-blasters-fc-vs-northeast-united-fc-2025-01-8e847f71c8d12167a50bb5de39bbf6b2-3x2.jpg",
      "source_name": "News 18"
    },
    {
      "title": "ISL 2024-25: Bengaluru FC aims to revive title race against bottom-placed Hyderabad FC",
      "link": "https://sportstar.thehindu.com/football/indian-football/hyderabad-fc-vs-bengaluru-fc-preview-isl-2024-25-hfc-v-bfc-sunil-chhetri-news/article69108695.ece",
      "description": "Bengaluru FC is looking to avoid a third consecutive loss, to sustain pressure on its opponents in the upper half of the points table.",
      "pubDate": "2025-01-17 12:14:53",
      "image_url": "https://ss-i.thgim.com/public/incoming/sm7e21/article69108867.ece/alternates/LANDSCAPE_1200/CBXH0047A.jpg",
      "source_name": "Sport Star The Hindu"
    }
  ]
}